console.log("Hello, World!");

//Домашнє завдання 07
//Запитати у користувача рік народження.
//Запитати в нього, в якому місті він живе.
//Запитати його улюблений вид спорту.
//При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:
//Його вік.
//Якщо користувач вкаже Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, столицею якої є місто. Інакше показуємо йому “ти живеш у місті…” і місце точок – введене місто.
//Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач вкаже один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати …? і підставляємо на місце точок ім'я та прізвище чемпіона.
//Все це має бути відображено в одному вікні (алерті).
//Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення – “Шкода, що Ви не захотіли ввести свій(ю) …” і вказуємо, що він не захотів вводити – дату народження, місто чи вид спорту .


const userYearBirth = prompt("Введіть свій рік народження:");
if(userYearBirth === null) alert("Шкода, що ти не захотів ввести свій рік народження");

const userCity = prompt("Введіть місто, в якому проживаєте:");
if(userCity === null ) alert("Шкода, що ти не захотів ввести своє місто");

const userSport = prompt("Введіть свій улюбленний вид спорту");
if(userSport === null) alert("Шкода, що ти не захотів ввести свій  улюбленний вид спорту");

let country;
let championSport;

userCity === "Київ" ? country = "столиці України" : 
userCity === "Вашингтон" ? country = "столиці США" : 
userCity === "Лондон" ? country = "столиці Велікобританії" : 
country = `місті ${userCity}` ;

userSport === "волейбол" ? championSport = " як Джоване Гавио" : 
userSport === "футбол" ? championSport = "як Пеле" : 
userSport === "фехтование" ? championSport = "як Ксения Пантелеева" : 
championSport = `Чемпіоном` ;

if(userYearBirth === null || userCity === null || userSport === null ) ;

else alert(`Тобі ${2022-userYearBirth} років. Ти живеш у ${country} . Круто! Бажаєшь стати ${championSport} !!! `);